# ПРАКТИЧЕСКАЯ РАБОТА №2. Управляющие структуры


## Содержание

🔍 [Теоретический минимум](#Теоретический-минимум)  
💡 [Полезные ссылки](#Полезные-ссылки)  
⚔️ [Учебная задача](#Учебная-задача)  
📋 [Задания](#Задания)  
🚩 [Контрольные вопросы](#Контрольные-вопросы)

*** 

## Теоретический минимум

### Ветвления
* Оператор `if-else`: используется для проверки условий. Если условий много, применяется конструкция `else if`.

* Оператор `switch`: идеален для выбора одного из множества целочисленных или символьных значений.

### Циклы
* Цикл `for`: применяется, когда заранее известно количество повторений (итераций).

* Цикл `while`: цикл с предусловием. Выполняется до тех пор, пока условие истинно.

* Цикл `do-while`: цикл с постусловием. Гарантированно выполняется хотя бы один раз.

### Точность вычислений в циклах
При использовании вещественных чисел (`double`) в качестве счетчика цикла может возникнуть проблема накопления погрешности. Рекомендуется использовать небольшую «дельту» в условии выхода: `x <= end + step/10`.


## Полезные ссылки

1. [Уроки по С++ (ravesli.com)](https://ravesli.com/uroki-cpp/)
2. [Лекции преподавателя МФТИ (youtube.com)](https://www.youtube.com/playlist?list=PLmSYEYYGhnBviRYhIDty-CSTDS16a3whl)
3. [Официальная документация языка ](https://cppreference.com/)


## Учебная задача


### Учебная задача №1: Разветвляющийся алгоритм

**Условие:** Вычислить значение $y$ для введенного $x$: если $x < 0$, то $y = x^2$; если $0 \le x < 10$, то $y = 2x + 5$; иначе $y = \sqrt{x}$.

```cpp
#include <iostream>
#include <cmath>

int main() {
    double x, y;
    std::cout << "Enter x: ";
    std::cin >> x;

    if (x < 0) {
        y = std::pow(x, 2);
    } else if (x >= 0 && x < 10) {
        y = 2 * x + 5;
    } else {
        y = std::sqrt(x);
    }

    std::cout << "For x = " << x << " value y = " << y << std::endl;
    return 0;
}

```

### Учебная задача №2: Табулирование функции (Цикл for)

**Условие:** Вывести таблицу значений функции $f(x) = \sin(x) \cdot x$ на отрезке $[0, 3]$ с шагом $0.5$.

```cpp
#include <iostream>
#include <iomanip>
#include <cmath>

int main() {
    double start = 0, end = 3, step = 0.5;

    std::cout << std::setw(10) << "x" << std::setw(15) << "f(x)" << std::endl;
    std::cout << "--------------------------" << std::endl;

    for (double x = start; x <= end + step/10; x += step) {
        double f = std::sin(x) * x;
        std::cout << std::fixed << std::setprecision(2) 
                  << std::setw(10) << x << std::setw(15) << f << std::endl;
    }
    return 0;
}

```

### Учебная задача №3: Нахождение суммы ряда (Цикл while)

**Условие:** Найти сумму первых $N$ членов ряда $S = 1 + 1/2 + 1/3 + \dots + 1/N$.

```cpp
#include <iostream>

int main() {
    int n;
    std::cout << "Enter the number of terms in the series N: ";
    std::cin >> n;

    double sum = 0;
    int i = 1;
    while (i <= n) {
        sum += 1.0 / i;
        i++;
    }

    std::cout << "Sum of the series for N = " << n << " is " << sum << std::endl;
    return 0;
}

```


## Задания

### Задание 1. Кусочно-заданные функции (Ветвление)

**Условие:** Напишите программу, которая запрашивает у пользователя значение $x$ и вычисляет $y$ по одной из формул в зависимости от условий.



| Вариант | Условие 1 ($x < 0$) | Условие 2 ($0 \le x < 5$) | Условие 3 ($x \ge 5$) |
| --- | --- | --- | --- |
| **1** | $y = \sin(x)$ | $y = x + 2$ | $y = \sqrt{x}$ |
| **2** | $y = \cos(x)$ | $y = x^2$ | $y = x - 1$ |
| **3** | $y = x$ | $y = x / 10$ | $y= \exp(x)$ |
| **4** | $y = x^2 + 1$ | $y = \sqrt{x+1}$ | $y = 2x$ |
| **5** | $y = \exp(x)$ | $y = \ln(x+1)$ | $y = x/2$ |
| **6** | $y = 1 - x$ | $y = \sin(x^2)$ | $y = \sqrt{x}$ |
| **7** | $y = \sqrt{x}$ | $y = x + 5$  | $y = \ln(x+1)$ |
| **8** | $y = x + 5$ | $y = \exp(x/2)$ | $y = 10$ |
| **9** | $y = \sin(x) + \cos(x)$ | $y = x^2 - 4$ | $y = \sqrt{x}$ |
| **10** | $y = 2x$ | $y = x - 2$ | $y = \sqrt{x}$ |
| **11** | $y = x^3$ | $y = \sqrt{x+4}$ | $y = 1/x$ |
| **12** | $y = 4 - x$ | $y = \sin(x/2)$ | $y = \exp(x)$ |
| **13** | $y = \sqrt[3]{x}$ | $y = x + 3$ | $y = x^2$ |
| **14** | $y = \cos(2x)$ | $y = 3 - x$ | $y = \sqrt{x}$ |
| **15** | $y = x+1$| $y = \sin(x)$ | $y = x/4$ |
| **16** | $y = 5 - 2x$ | $y = \sin(x)$ | $y = \sqrt{x+2}$ |
| **17** | $y = x^2 - 1$ | $y = \cos(x)$ | $y = 3/x$ |
| **18** | $y = \exp(-x)$ | $y = x + 1$ | $y = \ln(x)$ |
| **19** | $y = \sqrt{1-x}$ | $y = \sin(x)$ | $y = x^2$ |
| **20** | $y = x/4$ | $y = \exp(x)$ | $y = \sqrt{x}$ |



### Задание 2. Табулирование функций (Цикл `for`)

**Условие:** Выведите таблицу значений функции $f(x)$ на отрезке $[a,b]$ с шагом $h$. Используйте `std::setw` и `std::setprecision` для оформления.


| Вариант | Функция $f(x)$ | Отрезок $[a,b]$ | Шаг $h$ |
| --- | --- | --- | --- |
| **1** | $f(x) = x^2 + \sin(x)$ | $[0, 5]$ | $0.5$ |
| **2** | $f(x) = \sqrt{x} \cdot \cos(x)$ | $[1, 4]$ | $0.3$ |
| **3** | $f(x) = \exp(x) - x$ | $[-2, 2]$ | $0.4$ |
| **4** | $f(x) = \ln(x + 1)$ | $[0, 3]$ | $0.25$ |
| **5** | $f(x) = \sin(2x) + 1$ | $[0, \pi]$ | $\pi/10$ |
| **6** | $f(x) = x^3 - 2x$ | $[-3, 3]$ | $0.6$ |
| **7** | $f(x) = \cos(x^2)$ | $[0, 2]$ | $0.2$ |
| **8** | $f(x) = \sqrt{x^2 + 1}$ | $[0, 10]$ | $1.0$ |
| **9** | $f(x) = \tan(x/2)$ | $[0, 1.5]$ | $0.15$ |
| **10** | $f(x) = 1 / (x + 2)$ | $[0, 4]$ | $0.5$ |
| **11** | $f(x) = 2x + \cos(x)$ | $[0, 2\pi]$ | $\pi/8$ |
| **12** | $f(x) = x \cdot \exp(-x)$ | $[0, 5]$ | $0.5$ |
| **13** | $f(x) = \sqrt[3]{x+1}$ | $[0, 7]$ | $0.7$ |
| **14** | $f(x) = \sin^2(x)$ | $[0, \pi]$ | $\pi/12$ |
| **15** | $f(x) = x^2 - 5$| $[-10, 20]$ | $0.5$ |
| **16** | $f(x) = \cos(x) / (x+1)$ | $[0, 2]$ | $0.2$ |
| **17** | $f(x) = x^2 - \ln(x+1)$ | $[0, 4]$ | $0.4$ |
| **18** | $f(x) = \sqrt{x} \cdot \sin(x)$ | $[0, 6]$ | $0.6$ |
| **19** | $f(x) = \exp(-x^2)$ | $[-2, 2]$ | $0.4$ |
| **20** | $f(x) = (x+1)^2$ | $[0, 5]$ | $0.5$ |



### Задание 3. Суммирование рядов (Цикл `while` / `do-while`)

**Условие:** Вычислить сумму первых $N$ членов числового ряда. Значение $N$ вводится пользователем.

| Вариант | Формула $n$-го члена ряда ($a_n$)| Вариант | Формула $n$-го члена ряда ($a_n$) |
| --- | --- | --- | --- |
| **1** | $1 / n^2$ | **11** | $1 / (3n - 1)$ |
| **2** |$1 / (2n + 1)$  | **12** | $n / 2^n$ |
| **3** | $n / (n + 1)$ | **13** | $(n + 1) / n^2$ |
| **4** | $(-1)^n / n$ | **14** | $1 / \sqrt{n}$ |
| **5** | $1 / (n \cdot (n+1))$ | **15** | $2^n / (n + 1)$ |
| **6** |  $1 / n!$ | **16** | $1 / (n^2 + 1)$ |
| **7** | $(2n - 1) / 2n$ | **17** | $(-1)^{n+1} / (2n)$ |
| **8** | $1 / 3^n$ | **18** | $\sqrt{n} / (n + 1)$ |
| **9** | $n^2 / (n^2 + 1)$ | **19** | $1 / (4n - 3)$ |
| **10** | $(-1)^n / (2n - 1)$ | **20** | $n / (2n + 3)$ |




## Контрольные вопросы

1. В каком случае `switch` удобнее, чем `if-else`?

2. Что произойдет, если забыть инкремент (увеличение счетчика) в цикле `while`?

3. В чем главное отличие цикла `do-while` от цикла `while`?

4. Как реализовать бесконечный цикл и как из него выйти программно?

